wills-columnar-format.org
:PROPERTIES:
:header-args: :comments link
:END:
#+title: Will's Columnar Format
#+author: Will Medrano
#+email: will.s.medrano@gmail.com
#+date: 2023-04-23

* Introduction
:PROPERTIES:
:CUSTOM_ID: Introduction-h6a696o03tj0
:END:

#+begin_src rust :tangle src/lib.rs :exports none
  pub mod rle;

  #[cfg(test)]
  pub mod test_bincode;
  #[cfg(test)]
  mod test_lib;
  #[cfg(test)]
  mod test_rle;

  use bincode::{Decode, Encode};
  use itertools::Either;
  use std::any::TypeId;
#+end_src

#+begin_src rust :tangle src/rle.rs :exports none
  use bincode::{Decode, Encode};
#+end_src

#+begin_src rust :tangle src/test_bincode.rs :exports none
  use crate::rle;
#+end_src

#+begin_src rust :tangle src/test_lib.rs :exports none
  use super::*;
  use itertools::assert_equal;
#+end_src

#+begin_src rust :tangle src/test_rle.rs :exports none
  use crate::rle::*;
  use itertools::assert_equal;
#+end_src

*Will's Columnar Format V0*

[[https://wmedrano.dev/literate-programs/wills-columnar-format][Will's Columnar Format]] is a columnar format made by will.s.medrano@gmail.com. It
is primarily implemented for educational purposes. If you are interested in
using a well supported columnar format, consider using [[https://parquet.apache.org/][Apache Parquet]].

** Conventions
:PROPERTIES:
:CUSTOM_ID: IntroductionConventions-gbb696o03tj0
:END:

The following conventions are used:
- All structs are encoded using [[https://github.com/bincode-org/bincode][Bincode]]. Bincode is a binary
  encoding/decoding scheme implemented in Rust.
- Source code snippets are presented for relatively high level constructs. Lower
  level details may be omitted from presentation.

** Building and Testing Library
:PROPERTIES:
:CUSTOM_ID: IntroductionBuildingandTestingLibrary-r0c696o03tj0
:END:

Will's Columnar Format is programmed in Org mode with Rust code
blocks. Compiling requires Emacs and Cargo, the Rust package manager.

To generate the Rust source code, run ~M-x org-babel-tangle~ for
=wills-columnar-format.org= within Emacs. To automatically tangle the current
file on save, run:

#+begin_src emacs-lisp
  (add-hook 'after-save-hook #'org-babel-tangle 0 t)
#+end_src

Building and testing relies on Cargo.

#+begin_src shell
  cargo build
  cargo test
  cargo test $FN_TO_TEST
#+end_src

** Cargo.toml
:PROPERTIES:
:CUSTOM_ID: IntroductionCargotoml-cqc696o03tj0
:END:

#+begin_src toml :tangle Cargo.toml
  [package]
  name = "columnar-format"
  version = "0.1.0"
  edition = "2021"

  # See more keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html

  [dependencies]
  bincode = "2.0.0-rc.3"
  itertools = "0.10"
#+end_src

* Features
:PROPERTIES:
:CUSTOM_ID: Features-0ed696o03tj0
:END:

*** V0 Features
:PROPERTIES:
:CUSTOM_ID: FeaturesV0Features-81e696o03tj0
:END:

V0 is roughly implemented but still requires graceful error handling, and
bench-marking.

Supports:
- Only a single column per encode/decode.
- Integer (both signed and unsigned) and String types.
- Run length encoding.

*** Tentative V1 Features
:PROPERTIES:
:CUSTOM_ID: FeaturesTentativeV1Features-ppe696o03tj0
:END:

- Automatically determine if RLE should be applied.
- Dictionary encoding for better string compression.
- Compression (like zstd or snappy) for data.
- Multiple columns.
- Push down filtering.
- Split column data into blocks. Required to implement effective push down filtering.

* API
:PROPERTIES:
:CUSTOM_ID: API-6ef696o03tj0
:END:

** Encoding
:PROPERTIES:
:CUSTOM_ID: APIEncoding-w0g696o03tj0
:END:

~encode_column~ encodes a ~Vec<T>~ into Will's Columnar Format. If ~use_rle~ is
true, then run length encoding will be used.

#+begin_src rust :tangle src/lib.rs
  pub fn encode_column<T>(data: Vec<T>, use_rle: bool) -> Vec<u8>
  where
      T: 'static + bincode::Encode + Eq,
  {
      encode_column_impl(data, use_rle)
  }
#+end_src

** Decoding
:PROPERTIES:
:CUSTOM_ID: APIDecoding-npg696o03tj0
:END:

~decode_column~ decodes data from a byte stream into an iterator of
~rle::Element<T>~. See [[id:DataEncodingRunLengthEncoding-0vm696o03tj0][Run Length Encoding]].

#+begin_src rust :tangle src/lib.rs
  pub fn decode_column<T>(r: &mut impl std::io::Read) -> impl Iterator<Item = rle::Element<T>>
  where
      T: 'static + Clone + bincode::Decode,
  {
      decode_column_impl(r)
  }
#+end_src

** Optimization Tips
:PROPERTIES:
:CUSTOM_ID: OptimizationTips-45i696o03tj0
:END:

*** Sorting Data
:PROPERTIES:
:CUSTOM_ID: OptimizationTipsSortingData-rsi696o03tj0
:END:

Sorting may be very beneficial if:

- Order is not important.
- There are lots of repeated values.

If the above are true, try sorting and enabling run length encoding. Run length
encoding is efficient at storing data that is heavily repeated. By sorting, the
data will have longer runs of consecutive repeated values.


