src/rle.rs
// [[file:../wills-columnar-format.org::#Introduction-h6a696o03tj0][Introduction:2]]
use bincode::{Decode, Encode};
// Introduction:2 ends here
