src/test_lib.rs
// [[file:../wills-columnar-format.org::#Introduction-h6a696o03tj0][Introduction:4]]
use super::*;
use itertools::assert_equal;
// Introduction:4 ends here

// [[file:../wills-columnar-format.org::#APITests-vfh696o03tj0][Tests:1]]
#[test]
