wills-columnar-format.org
** Tests
:PROPERTIES:
:CUSTOM_ID: APITests-vfh696o03tj0
:END:

#+begin_src rust :tangle src/test_lib.rs
  #[test]
  fn test_header_contains_magic_bytes() {
      let data: Vec<i64> = vec![1, 2, 3, 4];
      let encoded_data: Vec<u8> = encode_column(data.clone(), false);
      assert_eq!(&encoded_data[0..MAGIC_BYTES_LEN], b"wmedrano0");
  }
#+end_src

#+begin_src rust :tangle src/test_lib.rs :exports none
  fn test_can_encode_and_decode_for_type<T>(elements: [T; 2])
  where
      T: 'static + Clone + Encode + Decode + Eq + std::fmt::Debug,
  {
      let data: Vec<T> = elements.to_vec();
      let encoded_data: Vec<u8> = encode_column(data.clone(), false);
      let mut encoded_data_cursor = std::io::Cursor::new(encoded_data);
      assert_equal(
          decode_column::<T>(&mut encoded_data_cursor),
          [
              rle::Element {
                  element: elements[0].clone(),
                  run_length: 1,
              },
              rle::Element {
                  element: elements[1].clone(),
                  run_length: 1,
              },
          ],
      );
  }
#+end_src

#+begin_src rust :tangle src/test_lib.rs
  #[test]
  fn test_encode_decode_several() {
      test_can_encode_and_decode_for_type::<i8>([-1, -1]);
      test_can_encode_and_decode_for_type::<u8>([1, 2]);
      test_can_encode_and_decode_for_type::<i16>([-1, 1]);
      test_can_encode_and_decode_for_type::<u16>([1, 2]);
      test_can_encode_and_decode_for_type::<i32>([-1, 1]);
      test_can_encode_and_decode_for_type::<u32>([1, 2]);
      test_can_encode_and_decode_for_type::<i64>([-1, 1]);
      test_can_encode_and_decode_for_type::<u64>([1, 2]);
      test_can_encode_and_decode_for_type::<String>(["a".to_string(), "b".to_string()]);
  }
#+end_src

#+begin_src rust :tangle src/test_lib.rs
  #[test]
  fn test_encode_decode_integer() {
      let data: Vec<i64> = vec![-1, 10, 10, 10, 11, 12, 12, 10];
      let encoded_data = encode_column(data.clone(), false);
      assert_eq!(encoded_data.len(), 22);

      let mut encoded_data_cursor = std::io::Cursor::new(encoded_data);
      assert_equal(
          decode_column::<i64>(&mut encoded_data_cursor),
          [
              rle::Element {
                  element: -1,
                  run_length: 1,
              },
              rle::Element {
                  element: 10,
                  run_length: 1,
              },
              rle::Element {
                  element: 10,
                  run_length: 1,
              },
              rle::Element {
                  element: 10,
                  run_length: 1,
              },
              rle::Element {
                  element: 11,
                  run_length: 1,
              },
              rle::Element {
                  element: 12,
                  run_length: 1,
              },
              rle::Element {
                  element: 12,
                  run_length: 1,
              },
              rle::Element {
                  element: 10,
                  run_length: 1,
              },
          ],
      );
  }
#+end_src

#+begin_src rust :tangle src/test_lib.rs
  #[test]
  fn test_encode_decode_string() {
      let data: Vec<&'static str> = vec!["foo", "foo", "foo", "bar", "baz", "foo"];
      let encoded_data = encode_column(data.clone(), false);
      assert_eq!(encoded_data.len(), 38);

      let mut encoded_data_cursor = std::io::Cursor::new(encoded_data);
      assert_equal(
          decode_column::<String>(&mut encoded_data_cursor),
          [
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "bar".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "baz".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 1,
              },
          ],
      );
  }
#+end_src

#+begin_src rust :tangle src/test_lib.rs
  #[test]
  fn test_encode_decode_string_with_rle() {
      let data = ["foo", "foo", "foo", "bar", "baz", "foo"];
      let encoded_data = encode_column(data.to_vec(), true);
      assert_eq!(encoded_data.len(), 34);

      let mut encoded_data_cursor = std::io::Cursor::new(encoded_data);
      assert_equal(
          decode_column::<String>(&mut encoded_data_cursor),
          [
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 3,
              },
              rle::Element {
                  element: "bar".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "baz".to_string(),
                  run_length: 1,
              },
              rle::Element {
                  element: "foo".to_string(),
                  run_length: 1,
              },
          ],
      );
  }
#+end_src

* Format Specification
:PROPERTIES:
:CUSTOM_ID: FormatSpecification-zfj696o03tj0
:END:

** Format Overview
:PROPERTIES:
:CUSTOM_ID: FormatSpecificationFormatOverview-j3k696o03tj0
:END:

- =magic-bytes= - The magic bytes are 9 bytes long with the contents being "wmedrano0".
- =header= - The header contains metadata about the column.
- =data= - The encoded column data.

#+begin_src rust :tangle src/lib.rs
  fn encode_column_impl<T>(data: Vec<T>, use_rle: bool) -> Vec<u8>
  where
      T: 'static + bincode::Encode + Eq,
  {
      let elements = data.len();
      let encoded_data = if use_rle {
          encode_data_rle_impl(data)
      } else {
          encode_data_base_impl(data)
      };
      let header = Header {
          data_type: DataType::from_type::<T>().unwrap(),
          use_rle,
          elements,
          data_size: encoded_data.len(),
      };
      encode_header_and_data(MAGIC_BYTES, header, encoded_data)
  }
#+end_src

#+begin_src rust :tangle src/lib.rs :exports none
  const MAGIC_BYTES_LEN: usize = 9;
  const MAGIC_BYTES: &[u8; MAGIC_BYTES_LEN] = b"wmedrano0";
  const BINCODE_DATA_CONFIG: bincode::config::Configuration = bincode::config::standard();

  fn encode_header_and_data(
      magic_bytes: &'static [u8],
      header: Header,
      encoded_data: Vec<u8>,
  ) -> Vec<u8> {
      assert_eq!(header.data_size, encoded_data.len());
      Vec::from_iter(
          magic_bytes
              .iter()
              .copied()
              .chain(header.encode())
              .chain(encoded_data.iter().copied()),
      )
  }

  fn decode_column_impl<T: 'static + bincode::Decode>(
      r: &mut impl std::io::Read,
  ) -> impl Iterator<Item = rle::Element<T>> {
      let mut magic_string = [0u8; MAGIC_BYTES_LEN];
      r.read_exact(&mut magic_string).unwrap();
      assert_eq!(
          &magic_string, MAGIC_BYTES,
          "Expected magic string {:?}.",
          MAGIC_BYTES
      );
      let header = Header::decode(r);
      assert!(
          header.data_type.is_supported::<T>(),
          "Format of expected type {:?} does not support {:?}.",
          header.data_type,
          std::any::type_name::<T>(),
      );
      if header.use_rle {
          let rle_elements: Vec<rle::Element<T>> =
              bincode::decode_from_std_read(r, BINCODE_DATA_CONFIG).unwrap();
          Either::Left(rle_elements.into_iter())
      } else {
          let elements: Vec<T> = bincode::decode_from_std_read(r, BINCODE_DATA_CONFIG).unwrap();
          Either::Right(elements.into_iter().map(|element| rle::Element {
              element,
              run_length: 1,
          }))
      }
  }
#+end_src

