wills-columnar-format.org
** Header
:PROPERTIES:
:CUSTOM_ID: FormatSpecificationHeader-3tk696o03tj0
:END:

The header contains a Bincode V2 encoded struct:

#+begin_src rust :exports none :tangle src/lib.rs
  impl Header {
      const CONFIGURATION: bincode::config::Configuration = bincode::config::standard();
  }

  impl DataType {
      const ALL_DATA_TYPE: [DataType; 2] = [DataType::Integer, DataType::String];

      fn from_type<T: 'static>() -> Option<DataType> {
          DataType::ALL_DATA_TYPE
              .into_iter()
              .find(|dt| dt.is_supported::<T>())
      }

      fn is_supported<T: 'static>(&self) -> bool {
          let type_id = TypeId::of::<T>();
          match self {
              DataType::Integer => [
                  TypeId::of::<i8>(),
                  TypeId::of::<u8>(),
                  TypeId::of::<i16>(),
                  TypeId::of::<u16>(),
                  TypeId::of::<i32>(),
                  TypeId::of::<u32>(),
                  TypeId::of::<i64>(),
                  TypeId::of::<u64>(),
              ]
              .contains(&type_id),
              DataType::String => {
                  [TypeId::of::<String>(), TypeId::of::<&'static str>()].contains(&type_id)
              }
          }
      }
  }

  impl Header {
      fn encode(&self) -> Vec<u8> {
          bincode::encode_to_vec(self, Self::CONFIGURATION).unwrap()
      }

      fn decode(r: &mut impl std::io::Read) -> Header {
          bincode::decode_from_std_read(r, Self::CONFIGURATION).unwrap()
      }
  }
#+end_src

#+begin_src rust :tangle src/lib.rs
  #[derive(Encode, Decode, PartialEq, Eq, Copy, Clone, Debug)]
  pub struct Header {
      pub data_type: DataType,
      pub use_rle: bool,
      pub elements: usize,
      pub data_size: usize,
  }

  #[derive(Encode, Decode, PartialEq, Eq, Copy, Clone, Debug)]
  pub enum DataType {
      Integer = 0,
      String = 1,
  }
#+end_src

* Data Encoding
:PROPERTIES:
:CUSTOM_ID: DataEncoding-sgl696o03tj0
:END:

** Basic Encoding
:PROPERTIES:
:CUSTOM_ID: DataEncodingBasicEncoding-e4m696o03tj0
:END:

The data consists of a sequence of encoded data. Encoding happens using the Rust
[[https:github.com/bincode-org/bincode][Bincode]] v2 package to encode/decode data of type ~&[T]~ and ~Vec<T>~.

Note: Bincode v2 currently in release candidate.

#+begin_src rust :tangle src/lib.rs
  fn encode_data_base_impl<T: 'static + bincode::Encode>(data: Vec<T>) -> Vec<u8> {
      bincode::encode_to_vec(data, BINCODE_DATA_CONFIG).unwrap()
  }
#+end_src

#+begin_src rust :tangle src/test_bincode.rs :exports none
  fn encoded_size<T: bincode::Encode>(element: T) -> usize {
      bincode::encode_to_vec(element, bincode::config::standard())
          .unwrap()
          .len()
  }
#+end_src

#+begin_src rust :tangle src/test_bincode.rs
  #[test]
  fn test_encoding_size() {
      // Small numbers are encoded efficiently.
      assert_eq!(encoded_size(1u8), 1);
      assert_eq!(encoded_size(-1i8), 1);
      assert_eq!(encoded_size(1u64), 1);
      assert_eq!(encoded_size(-1i64), 1);

      // Larger numbers use more bytes with varint encoding. This does not apply
      // to u8 and i8 which do not use varint.
      assert_eq!(encoded_size(255u16), 3);
      assert_eq!(encoded_size(255u8), 1);
      assert_eq!(encoded_size(127i8), 1);
      assert_eq!(encoded_size(-128i8), 1);

      // Derived types (like Structs and Tuples) take up as much space as their subcomponents.
      assert_eq!(encoded_size(1u64), 1);
      assert_eq!(encoded_size(25564), 3);
      assert_eq!(encoded_size((1u64, 255u64)), 4);
      assert_eq!(
          encoded_size(rle::Element {
              element: 1u64,
              run_length: 255
          }),
          4
      );

      // Strings take up string_length + 1.
      assert_eq!(encoded_size("string"), 7);
      assert_eq!(encoded_size(String::from("string")), 7);
      assert_eq!(encoded_size((1u8, String::from("string"))), 8);

      // Fixed sized slices take up space for each of its encoded
      // elements. Variable size slices (or slice references) and vectors take
      // up an additional varint integer of overhead for encoding the length.
      assert_eq!(encoded_size::<&[u8; 3]>(&[1u8, 2, 3]), 3);
      assert_eq!(encoded_size::<[u8; 3]>([1u8, 2, 3]), 3);
      assert_eq!(encoded_size::<&[u8]>(&[1u8, 2, 3]), 4);
      assert_eq!(encoded_size(vec![1u8, 2, 3]), 4);
  }
#+end_src

#+name: run-length-encoding
** Run Length Encoding
:PROPERTIES:
:CUSTOM_ID: DataEncodingRunLengthEncoding-0vm696o03tj0
:END:

Run length encoding [[[https://en.wikipedia.org/wiki/Run-length_encoding#:~:text=Run%2Dlength%20encoding%20(RLE),than%20as%20the%20original%20run.][Wikipedia]]] is a compression technique for repeated values.

#+begin_src rust :tangle src/rle.rs
  #[derive(Encode, Decode, Copy, Clone, PartialEq, Debug)]
  pub struct Element<T> {
      // The underlying element.
      pub element: T,
      // Run length is stored as a u64. We could try using a smaller datatype,
      // but Bincode uses "variable length encoding" for integers which is
      // efficient for smaller sizes.
      pub run_length: u64,
  }
#+end_src

To encode data of type ~Vec<T>~ with RLE, it is first converted into a
~Vec<rle::Element<T>>~. It is then used to encode the run length encoded vector
into bytes.

#+begin_src rust :tangle src/lib.rs
  fn encode_data_rle_impl<T: 'static + bincode::Encode + Eq>(data: Vec<T>) -> Vec<u8> {
      let rle_data: Vec<rle::Element<T>> = rle::EncodeIter::new(data.into_iter()).collect();
      encode_data_base_impl(rle_data)
  }
#+end_src

#+begin_src rust :tangle src/rle.rs
  pub struct EncodeIter<I: Iterator> {
      inner: std::iter::Peekable<I>,
  }

  impl<I> Iterator for EncodeIter<I>
  where
      I: Iterator,
      I::Item: PartialEq,
  {
      type Item = Element<I::Item>;

      fn next(&mut self) -> Option<Element<I::Item>> {
          // Start the run or exit if the underlying iterator is empty.
          let element = match self.inner.next() {
              Some(e) => e,
              None => return None,
          };
          let mut run_length = 1;

          // Continue the run as long as the next element is equal to the current running element.
          while self.inner.next_if_eq(&element).is_some() {
              run_length += 1;
          }

          Some(Element {
              element,
              run_length,
          })
      }
  }
#+end_src

#+begin_src rust :tangle src/rle.rs :exports none
  impl<I> EncodeIter<I>
  where
      I: Iterator,
  {
      pub fn new(iter: I) -> EncodeIter<I> {
          EncodeIter {
              inner: iter.peekable(),
          }
      }
  }
#+end_src

*** Tests
:PROPERTIES:
:CUSTOM_ID: DataEncodingRunLengthEncodingTests-xhn696o03tj0
:END:

#+begin_src rust :tangle src/test_rle.rs
  #[test]
  fn test_encode_data_without_elements_produces_no_elements() {
      let data: Vec<String> = vec![];
      assert_equal(EncodeIter::new(data.into_iter()), []);
  }

  #[test]
  fn test_encode_data_combines_repeated_elements() {
      let data = [
          "repeated-3",
          "repeated-3",
          "repeated-3",
          "no-repeat",
          "repeated-2",
          "repeated-2",
          "repeated-3",
          "repeated-3",
          "repeated-3",
      ];
      assert_equal(
          EncodeIter::new(data.into_iter()),
          [
              Element {
                  run_length: 3,
                  element: "repeated-3",
              },
              Element {
                  run_length: 1,
                  element: "no-repeat",
              },
              Element {
                  run_length: 2,
                  element: "repeated-2",
              },
              Element {
                  run_length: 3,
                  element: "repeated-3",
              },
          ],
      );
  }
#+end_src

* Source Code
:PROPERTIES:
:CUSTOM_ID: SourceCode-45o696o03tj0
:END:

The source code is stored at
[[https://github.com/wmedrano/wills-columnar-format]]. The main source file is
=wills-columnar-format.org= which is used to generate the Rust source files like
=src/lib.rs=.
